; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image7 - mode
	image4 - mode
	thermograph3 - mode
	infrared1 - mode
	image5 - mode
	spectrograph6 - mode
	thermograph2 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image7)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph3)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image7)
	(supports instrument4 image5)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph6)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(have_image Star5 thermograph2)
	(have_image Planet6 thermograph2)
	(have_image Planet6 thermograph3)
	(have_image Planet7 image5)
	(have_image Planet8 image4)
	(have_image Planet8 thermograph2)
	(have_image Planet9 thermograph3)
	(have_image Planet10 image4)
	(have_image Planet11 image4)
))

)

; plan
1. (turn_to satellite1 groundstation4 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 9
2. (turn_to satellite0 groundstation1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 9
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
4. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 9
5. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   goals met: 0 of 9
6. (take_image satellite0 planet11 instrument2 image4)
   added: (have_image planet11 image4)
   goals met: 1 of 9
7. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 1 of 9
8. (take_image satellite0 planet10 instrument2 image4)
   added: (have_image planet10 image4)
   goals met: 2 of 9
9. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 9
10. (calibrate satellite1 instrument4 groundstation4)
   added: (calibrated instrument4)
   goals met: 2 of 9
11. (turn_to satellite0 planet6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet6)
   goals met: 2 of 9
12. (take_image satellite0 planet6 instrument2 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 3 of 9
13. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 3 of 9
14. (take_image satellite0 planet8 instrument2 image4)
   added: (have_image planet8 image4)
   goals met: 4 of 9
15. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 4 of 9
16. (take_image satellite0 planet9 instrument2 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 5 of 9
17. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 5 of 9
18. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 9
19. (turn_to satellite0 groundstation4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation4)
   goals met: 5 of 9
20. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 5 of 9
21. (turn_to satellite0 planet6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet6)
   goals met: 5 of 9
22. (take_image satellite0 planet6 instrument0 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 6 of 9
23. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 6 of 9
24. (take_image satellite0 planet8 instrument0 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 7 of 9
25. (turn_to satellite0 star5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star5)
   goals met: 7 of 9
26. (take_image satellite0 star5 instrument0 thermograph2)
   added: (have_image star5 thermograph2)
   goals met: 8 of 9
27. (turn_to satellite1 planet7 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet7)
   goals met: 8 of 9
28. (take_image satellite1 planet7 instrument4 image5)
   added: (have_image planet7 image5)
   goals met: 9 of 9
